{
  "slug": "a-year-of-two-halves",
  "title": "A Year of Two Halves",
  "date": "2025-12-17",
  "status": "Published",
  "summary": "Startup postmortems are two-a-penny. Failed to execute, got beaten by competition, ran out of cash – select as appropriate. A founder postmortem though… What happens when the world you constructed crumbles right in front of you? Here's my answer to that question.",
  "tags": [],
  "minutes": 7,
  "content": "<p>Back in January, I chose <em>glide</em> as my word for the year. Ha! Bless my naive heart.</p>\n<p>If you read that post, you'll recall a high-minded vision of effortless ascension. My friends, I looked like a plastic bag on the run.</p><p>In fairness, glide was less about looking classy (although that would have been nice), and more about responding to the environment. The environment just happened to be rather gusty.</p>\n<p>With that picture in mind, let's take a rummage through the rubble of 2025 and see if we can find some shiny bits.</p>\n<h3>H1, 2025</h3>\n<p>At the end of last year, I set Notation aside, and returned as co-founder to my prior venture.</p>\n<p>The theory was that two founders working in partnership stood a better chance of success if they joined their forces. (Or at least that's the bedtime story exhausted founders tell themselves). I would transfer my dev tools experience to the product trenches, and together we'd 20x the company to an acquisition.</p>\n<p>Feeling reflective (read: reassure myself that I am a competent professional), I decided to document my path to that goal.</p>\n<ol>\n<li><em>I launched a long-awaited reporting tool for our customers. This was a classic case of the final 10% taking 90% of the effort (and most of my Christmas holidays), but I eventually got it out the door.</em></li>\n<li><em>I eliminated a massive chunk of Fern's technical debt by consolidating three different infrastructure pipelines. In turn, this enabled us to spin up complete environments from scratch – handy if you want to move fast and not break prod.</em></li>\n</ol>\n<p>Let me quickly jump back in here, and, if I may, take you behind the scenes on this, because while the product was coming together, my body started falling apart.</p>\n<p>Readers might recall that I've had some chronic health challenges over the last few years. For the uninitiated, \"chronic\" doesn't mean that it never stops – you do get spells of good health – it's just that it keeps coming back. This year was like its comeback tour.</p>\n<p>For every bit of technical debt that got paid off, I seemed to be accumulating a commensurate amount of energy debt (that's a kind of biological hyperinflation where the cost of doing the laundry rises to three hours on the sofa). Adamant that I would not let this get in the way of our mission, the energy debt invariably got serviced in my free time.</p>\n<p>But, back to the highlight reel.</p>\n<ol start='3'>\n<li><em>I built a browser extension that operated as a local scraper, quickly opening and closing hundreds of tabs to check if a customer's products had won the Amazon buy box. This was an instant hit with customers, and, because it was running on their machines, it didn't require us to maintain any more infrastructure. Win!</em></li>\n<li><em>I set up a universal API over our fragmented data services (thank you so much to</em> <a href=\"https://ramnivas.com/\"><em>Ramnivas</em></a> <em>at</em> <a href=\"https://exograph.dev/\"><em>Exograph</em></a> <em>for the assist with this). This also laid the foundation for our new web app and data agent.</em></li>\n<li><em>Most satisfying of all, I mentored my non-coding colleagues, enabling them, with the help of AI assistants, to become productive contributors to the codebase.</em></li>\n</ol>\n<p>That camaraderie meant a lot to me. On top of the fatigue, I was getting regular brain zaps, random infections, and then – most fun – a persistent pain, for which I believe the formal medical definition is \"a literal ball ache\".</p>\n<p>Over the course of the year, I took five different types of antibiotics, various painkillers, and a drug that works essentially as a dimmer switch for the central nervous system – but that also wakes you up throughout the night (presumably to check you're still feeling miserable).</p>\n<p>At this point, my partner stepped in. At her behest, I went to the doctor, and pleaded with him to order me some big boy blood tests.</p>\n<p>Did I take this medical intervention as a sign to slow down? Don't be silly. We had a market to disrupt.</p>\n<p>The strategy was simple: we needed to muscle our little company to the front of the grid in what would inevitably become a race among the incumbents to integrate AI, so:</p>\n<ol start='6'>\n<li><em>I built an AI agent that enabled customers talk with their data and get strategic advice. The initial prototype worked so well it just felt magical. The feedback was great. The long tail of edge cases was both challenging and fascinating. We were in the midst of a huge paradigm shift. The technology was both weird (it can talk), and early enough that we needed to create a playbook for building with it.</em></li>\n</ol>\n<p>But I never saw that product ship, because all of a sudden, at the tail end of June, the trapdoor sprang open.</p>\n<p>As is wont to happen in startups – although I never imagined it happening at <em>my</em> startup – the journey ended abruptly. On Wednesday I was juggling a product launch with a trip to the phlebotomist; by Friday I was a man with a nervous disposition and a lot of free time on his hands. Like a terrible magic trick, years of investment suddenly disappeared into smoke.</p>\n<p>A fortnight later, my test results arrived – and with them the final reveal: I had Lyme disease.</p>\n<h3>H2, 2025</h3>\n<p>Like most chronic illnesses, Lyme is a sneaky little bastard. It can manifest in all manner of ways. For Justin Timberlake, it presented as nerve pain and fatigue; for Justin Bieber, as skin issues and brain fog (or what the gossip columns call a \"drug problem\"). The Welsh rapper Ren Gill was similarly misdiagnosed with bipolar disorder; it was years before his doctors realised he actually had Lyme disease. But it did at least inspire some cracking tunes.</p>\n<p>I already knew I was sick; now I knew <em>why</em>. This was good. I'd blown the disease's cover, which, in theory, meant I could lay siege on it. But to be perfectly honest, I was mostly just chuffed I could talk about my health without sounding like a hypochondriac.</p>\n<p>My friends and family – who have been wonderfully supportive – seemed a bit freaked (even if not entirely surprised by the news). My partner was driving when I got the call. I relayed the news, then returned to my reading. She was visibly upset so I put a hand on her shoulder and asked, \"what do you need, my love?\". She responded sharply: \"for you to stop reading about bloody Scots law and start reading about how we beat this!\".</p>\n<p>My (mistaken) understanding was that Lyme was basically incurable. In most cases, it is, in fact, perfectly curable, although the infection (or more precisely, the remnants of the infection) can be somewhat persistent, even after treatment.</p>\n<p>My favourite story involving post-treatment chronic Lyme syndrome is from a woman so beset by it that she travelled to California to end her life. Upon arrival she was inauspiciously <a href=\"https://www.bbc.co.uk/future/article/20150327-how-a-bee-sting-saved-my-life\">stung by a swarm of killer bees</a>. Instead of going to hospital, she thanked God for mercifully hastening her end, shut herself in a room, and instructed her carer to \"come collect the body tomorrow\". But rather than dying, she got better. Like, <em>a lot</em> better.</p>\n<p>Thankfully, conventional medicine seems to have put my health back on the right trajectory. At the very least, I now know what is happening in my body, and therefore have a better idea on how to manage it.</p>\n<hr>\n<p>So with all that drama out of the way, I sat back at my computer, opened a code editor, and began working on <em>The Next Thing</em>.</p>\n<p>The cursor blinked at me. I blinked back. This went on for a few minutes, and then I realised: I can't do this anymore.</p>\n<p>That feeling stayed with me for the next few months. Coding is pointless. This will never ship. I am wasting my time.</p>\n<p>It looked like procrastination. It felt like self-doubt. It was, in fact, grief.</p>\n<hr>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/b2b67600-2901-435f-b0f4-d0f2a387f3e6/hacf.jpg\" alt=\"Let it burn…\"><figcaption>Let it burn…</figcaption></figure>\n<p>As the year's been winding down, I've been catching up on <em>Halt and Catch Fire,</em> a period drama about startup trauma.</p>\n<p>The show opens with Gordon, a beat-out engineer, getting nerd-sniped into building the first portable PC by his sociopathic product manager.</p>\n<p>His colleague Cameron, the visionary, sharp-tongued girl genius, considers Gordon \"too scared to try anything different because he's traumatised from being a loser his entire life\".  Meanwhile, his wife Donna, is terrified that history will repeat itself. She and Gordon tried building a PC before, and it nearly landed their family in financial ruin.</p>\n<p>It's a show about dreaming to build something special, failing spectacularly, vowing never to repeat the mistake, and then doing it all over again. Cathartic.</p>\n<hr>\n<p>I don't want to linger on grief too long because I lost a SaaS platform, not a loved one. Real grief has dignity; people bring you casseroles. Startup grief is embarrassing. You're not just someone who has experienced a loss, you are <em>a</em> <em>loser</em>.</p>\n<p>To understand that pathology, you need to know that every founder has a mental image of themselves standing on the summit of success, holding two fingers up to everyone who ever doubted them. It's not the loss of income that hurts most, it's the loss of opportunity to one day be smug.</p>\n<p>Grief – now watch for the sleight of hand here – sees that loss and projects it into a recurring pattern. Do X again; be sure to lose Y. It feels so hopeless precisely because it is assumed to be so predictable. But grief's trick is to generate predictions based on old data. It references <em>past</em> versions of you.</p>\n<p>This was a tough year, and that's changed me in unexpected ways. No doubt, this latest version of me will do things differently. Which, of course, may still lead to disaster. But it might also be brilliant. Who knows?</p>\n<p>I find that level of uncertainty deeply reassuring.</p>\n<hr>\n<p>The year ended positively with the launch of <a href=\"http://act.cool/\">act.cool</a> – a platform I never expected to build, but that's turned into something refreshingly beautiful. I'll save what's cooking for another post, though.</p>\n<p>Looking back, I think that had I known the challenges ahead, I probably would have chosen <em>grit</em> as my word for the year. But I'm already pretty gritty – at this point, practically sandpaper. What I needed was not endless determination, but to get comfortable rolling with the punches.</p>\n<p>To a detached observer, that may have looked erratic. But when you are flying through a gale, simply staying in the air is heroic. That, I realised, is what it actually means to glide. It just took a storm to learn how.</p>"
}
