{
  "slug": "building-in-private",
  "title": "Building In Private",
  "date": "2024-06-18",
  "status": "Published",
  "summary": "",
  "month": "May ‘24",
  "tags": [
    {
      "id": "f05f9618-efc6-45bb-be1d-5a47132f899e",
      "name": "Month Notes",
      "color": "red"
    }
  ],
  "minutes": 3,
  "content": "<p>I've been fairly quiet about Notation the last few months. I'll briefly share why.</p>\n<p>At the start of the year, I launched a prototype, sharing my vision for the project. The feedback was pretty clear: promising product, but not ready for adoption. That was no great surprise – I know a lot of work is required for it to become a credible option.</p>\n<p>Thankfully I got some more specific insights too. These have helped me to reach conviction about both the direction of Notation, and the need to double-down on execution. So, right now, my status is head-down and focussed on building (with some really exciting things in the works).</p>\n<p>If focussing on execution explains why I'm busy, avoiding distractions is the reason I'm quiet. There's a class of tasks that seem important, but, under scrutiny, offer little meaningful impact. For example, right now, there would be minimal benefit from me promoting Notation to developers – developers who have already told me all the ways in which the product needs to evolve for them to consider adopting it.</p>\n<p>Some will make a case for building in public. I'm certainly not against it – at least not in principle – but building in public necessitates engaging on social media, and social media is highly distracting. I guess it depends on your personality. Do you like to do deep work inside a debating chamber? Personally, I prefer somewhere quiet.</p>\n<p>Take it from this solopreneur:</p>\n<blockquote>\n<p><em>I'm in a serious trouble</em> 🥴<br>\n<em>Social media has destroyed my productivity.<br>\nI started using it a year ago. It was all great at the start. I learned a lot, found new friends, employees, and partners, and promoted my products.<br>\nToday, I'm at the point when I work on a task that's slightly complex. I can't control myself, so I open X or YouTube. There is near zero chance that I'll be disappointed because the algorithm will perfectly present very intriguing content to me that I enjoy watching.</em></p>\n</blockquote>\n<p><a href=\"https://x.com/johnrushx/status/1800227618886713500\">@jonrushx on X </a></p>\n<p>John has used social media to build several successful businesses, but has now realised it's a double-edged sword. I'm taking note. Of course, I plan to be active on social media again in the future, but I'll be picking that moment carefully.</p>\n<p>To be perfectly honest, I wouldn't have thought any of this \"build in private\" stuff worth mentioning had it not turned out to be so controversial. Spending a long time in a pre-launch, build phase seems to run contrary to a lot of startup advice: <em>\"address market risk first\"</em>, <em>\"launch early\"</em>, <em>\"don't work on new features\"</em>, <em>\"talk to customers\".</em> This advice isn't wrong per se, but it is wrong in certain <em>contexts</em> ¹ʼ².</p>\n<p>Ultimately, we have to respond to the world as we discover it, and not be surprised when it doesn't follow the playbook we've been given. That sometimes means rejecting conventional (stale) wisdom and writing our own playbook.</p>\n<p>I'll reflect on this more in the future, but, for now, it's back to coding! ✌️</p>\n<hr>\n<p>[1] <a href=\"https://linear.app/blog/rethinking-the-startup-mvp-building-a-competitive-product\">Rethinking the startup MVP</a></p>\n<p>[2] <a href=\"https://www.youtube.com/watch?v=2ViqdR5E2wU&#x26;ab_channel=YCombinator\">When Should You Trust Your Gut?</a></p>"
}
