{
  "slug": "daniels-word-for-2024",
  "title": "Daniel’s Word for 2024",
  "date": "2024-01-02",
  "status": "Published",
  "summary": "",
  "minutes": 2,
  "content": "<p>I’ve always loved making New Year resolutions. The date is arbitrary but the timing is perfect: a week spent consuming TV and leftover turkey, then a brief moment to reflect before the economy gets switched back on again. There really is no better moment to roll out the proverbial flip chart and evaluate life's priorities.</p>\n<p>I’d guess that my resolution completion rate is somewhere around 50% – although this is more by accident than diligence. Most are forgotten by mid-February. A year is a long time to keep a goal front-of-mind.</p>\n<p>So, as an alternative to resolutions, I now come up with a word for the year.  One word for the whole year. That’s it.</p>\n<p>When this idea was first suggested to me, I chose the word <em>elevate</em>. I was fresh from dealing with a number of demoralising and distracting incidents. Instead of rising above them, I had got sucked into them. I took <em>elevate</em> into the following year to ensure that I didn't let that happen again. Having the word always to hand helped me stay on track and protect my own priorities.</p>\n<p>My word for this year is <em>faith</em>, which, now I write it down, sounds like something a televangelist might say, but bear with me.</p>\n<p>When I think about what I want to achieve in 2024, it seems almost impossible. There is so much to do, and many of the challenges have a lot of uncertainty attached to them. The biggest risk I face though is becoming overwhelmed and moving too slowly. Pausing at every challenge to ponder potential failure cases will all but guarantee the overall mission is not successful.</p>\n<p>Taking a leap of faith is to acknowledge below-average odds, while simultaneously holding onto two counter-intuitive beliefs:</p>\n<ol>\n<li>Acting with faith (e.g. engendering self-belief, and being open to a broad array of positive outcomes) improves the probability of success</li>\n<li>Failure is still a step towards the greater goal (by means of acquiring insights from the failure, and by unbinding attention to work on another task)</li>\n</ol>\n<p>Practically, this means: when I find myself deliberating about how to approach a problem, or experiencing imposter syndrome while working in a new area, or wondering how a feature launch will be perceived, I will think <em>faith</em> – faith in the process, faith in myself – and then just get on with it.</p>"
}
