{
  "slug": "daniels-word-for-2026",
  "title": "Daniel’s Word for 2026",
  "date": "2026-01-16",
  "status": "Published",
  "summary": "",
  "tags": [],
  "minutes": 3,
  "content": "<blockquote><p>We become visible and real when we give our gift and stop waiting for the gift to be given to us.</p><h5><strong>David Whyte</strong></h5></blockquote>\n<p></p><p>This is my fourth word of the year. In previous years, I chose elevate, <a href=\"https://danielgrant.co/posts/daniels-word-for-2024\">faith</a> and <a href=\"https://danielgrant.co/posts/daniels-word-for-2025\">glide</a>. This year's word is <em>gift</em>.</p>\n<h2>The Moment</h2>\n<p>The software industry is currently going through a dramatic transition. I've been looking back at some of my pre-AI projects and trying to work out which, if any, have value in a world where new code can be generated so cheaply.</p>\n<p>It's a mixed bag, but I'm as excited as ever about working in software – not because it's all over, but because there's so much to figure out. In some ways, the moment feels analogous to the start of the personal computing revolution. There is the risk of full-blown monopolisation; there are opportunities to ensure that the upside gets shared.</p>\n<h2>Slaying the Dragon</h2>\n<p>I have an embarrassingly large pile of unshipped projects – some potentially quite cool. What is driving my tendency to just sit on them? Is it protectionism? Or a fear to let go? Whatever it is, it's not rational.</p>\n<p>When you give someone a gift, you transfer ownership. You can't control whether they will like it or discard it. It can feel that the way they receive your gift is a reflection of yourself. This isn't a healthy mentality.</p>\n<p>Motto for the year: relax, don't worry.</p>\n<h2>Own the Idea, Not the IP</h2>\n<p>Many people invest a lot of time and money ensuring that no-one can steal their ideas. This strikes me as a mistake (in most instances).</p>\n<p>Ideas will be copied, remixed and improved upon whether you patent them or not. It is better to realise that sooner rather than later, and orchestrate things on your own terms. Optimise for retaining intellectual <em>provenance</em>, not intellectual property.</p>\n<p>When an idea is given freely, you quickly find out whether it's any good or not. This is itself a great gift. If the idea is good, it will spread, and if it spreads, there's often an opportunity to benefit from the recognition that comes with that.</p>\n<p>There is always the risk and fear of intellectual theft. The current fear is that AI models will ingest our ideas and offer nothing back in return. I hope that we find ways to ensure human innovation continues to be rewarded. It is foundational to the innovation economy.</p>\n<h2>Gifts for Me</h2>\n<p>Finally, this year I will try to gift myself more time for rest, for improving my health, and for spending time doing physical activities away from the screen.</p>"
}
