{
  "slug": "daniels-word-for-2025",
  "title": "Daniel’s Word for 2025",
  "date": "2025-01-15",
  "status": "Published",
  "summary": "My word for 2025. Drawing inspiration from Star Wars and a samurai teacher I met at a hippie festival. No cliches here. ",
  "tags": [],
  "minutes": 3,
  "content": "<p>It's that time again when I set a word for the year. I like this ritual. Instead of producing a list of goals that I'll forget within a month, I choose a single word that encapsulates all of them.</p>\n<p>In <a href=\"https://danielgrant.co/posts/daniels-word-for-2024\">2024</a>, I chose \"faith\" (as in: \"just do it\"). That served me pretty well. Then, at some point nearing the end of summer, I had the penny-drop realisation that faith is just half the story. On the other side of faith is always fear.</p>\n<p>Faith propels us forward. Fear holds us back. But fear can also drive us forward – or, perhaps more accurately, it drives us away from the failure outcomes we viscerally want to avoid. In that way, fear is a sneaky emotion to identify because it can also make us quite effective.</p>\n<p>A couple of things helped me recognise this condition. The first was a samurai workshop. An hour is obviously not enough time to even scratch the surface of what is a lifelong pursuit, but our <a href=\"https://thezensamurai.com/who-is-zen/\">teacher</a> did a good job of distilling some core ideas.</p>\n<p>He had us practise a single cut over and over, teaching us how to strike from a grounded position and then return to a grounded position. This means that when an attack comes, you a) are not caught off balance and knocked down, and b) are able to redirect the incoming energy to your advantage. He emphasised that this was not just physical, but also a discipline of the mind. \"Slice through the enemy in front of you\", we were told. \"That enemy is your dark self\".</p>\n<p>If that kind of language sounds familiar, it might be because the Jedi were, in part, modelled on the samurai. The battle between light and dark is <em>the</em> perennial theme of Star Wars shows. It's a tension that, traditionally, has been treated with little nuance (Jedi good, Sith bad). Then, this summer, The Acolyte was released, and was broadly hated by Star Wars nerds, but contained an exploration of <em>why</em> someone should be drawn to the dark side that really struck me. So, that was my second source of inspiration – a show currently rated 4.2/10 on IMDb.</p>\n<p>Over the last few years I've been on a journey exploring entrepreneurial opportunities. This obviously takes a lot of determination – just pushing through the sheer inertia of nothing changing unless you make it happen. Why do we keep doing it? What drives us to keep pushing?</p>\n<p>The key revelation in The Acolyte is that dark emotions are very powerful drivers (think: \"channel your anger\"), while positive emotions are less impactful and take more energy to nurture. When you frame it like this, I think many founders would class themselves as users of the dark side of the force.</p>\n<p>Being driven by dark emotions, whether that's a compulsion to prove yourself, or to avoid scarcity (insert your own chip on the shoulder here), clearly doesn't make someone a bad person. There are many people working on noble goals, driven to achieve them by a maelstrom of negative energy. Effective, but at what cost?</p>\n<p>Perhaps there's a different way to approach all this. My goals for this year are actually relatively unchanged. Instead I just want to upgrade how I move through life. I wanted to pick a word that encapsulates that motion. A motion that, like the samurai's, is smooth, effortless and grounded. Rudolf Laban, who categorised movements for performers, has a useful <a href=\"https://www.researchgate.net/figure/Labans-Effort-Actions_tbl1_228953074\">matrix</a>, and from it I've picked <em>glide</em> – a light, direct and sustained movement.</p>"
}
