{
  "slug": "digital-minimalism-data-hoarding",
  "title": "Digital Minimalism vs. Data Hoarding",
  "date": "2024-05-28",
  "status": "Published",
  "summary": "",
  "minutes": 4,
  "content": "<p>I've lately come to the realisation that, for the last few years, I've been living in the physical manifestation of a todo list. Looking around my flat I see unhung picture frames, a dishwasher that needs fixing, and countless rarely-used items consuming precious space. These low-priority niggles sit in my line of sight, and, each day, remind me (with a small dose of guilt) that I owe them my attention.</p>\n<p>Then I open my laptop, and find myself having a not so dissimilar reaction to the state of my virtual space. I can be a voracious note-taker, and after years of hoarding information, I feel a struggle between two competing desires: one to just wipe my hard disk clean, and the other to preserve every last asinine note for posterity.</p>\n<p>So, when April arrived with a few rays of sunlight, I decided enough was enough. Spring clean! Tidy hard disk, tidy mind. Obliterate the todo list. Guilt be gone!</p>\n<p>The underlying motivation is ultimately a desire to engage in deep work. Focussing on a project for weeks on end requires a long runway – one free of any obstacles blocking the flow of creative thought.</p>\n<p>Is this a form of procrastination? Probably, but that's not necessarily a bad thing. I  enjoyed <a href=\"https://www.ted.com/podcasts/rethinking-with-adam-grant/the-art-of-vulnerability-and-connection-with-mae-martin-transcript\">this conversation</a> between Adam Grant and the comedian Mae Martin as they touched on this theme. Mae shared how she once had strong feelings of shame associated with her tendency to procrastinate, and her subsequent journey to accept that whatever she is doing instead of <em>the thing</em>, is maybe just preparing her to do the thing. Adam, an organisational psychologist, enthusiastically agreed: with moderate procrastination, you are actually getting the benefit of <em>incubation</em>.</p>\n<p>But let's return to my dilemma: how do I reconcile my archivist tendencies with the desire for a clean slate. And, critically, how do I prevent this process escalating from structured procrastination into a gratuitous side quest?</p>\n<p>In the physical realm, the fastest way to get spring cleaning done is to hire a van and deliver all your unwanted stuff to a recycling centre. “Recycling centre” feels like a euphemism. When I was growing up it was called <em>the dump</em>, describing consumers' behaviour, rather than the process that may, or may not, happen after you've thrown a sofa into a shipping container.</p>\n<p>Trashing digital documents triggers a different aversion – to not destroy <em>knowledge –</em> but results in a similar neurosis. That is: meticulously going through each item and weighing up whether or not it's worth keeping.</p>\n<p>After filling two 64 litre boxes with documents such as my school reports, I wondered if I could do better with my digital files than to just throw them into cold storage. I briefly explored tools like Obsidian to create a so-called digital brain, and pondered setting up some kind of personal RAG, before pulling myself aside for a frank conversation. As anyone who has ever searched an enterprise's knowledge base will have discovered, knowledge is not an ever-growing heap of information. It is a bounded system in which new knowledge should push old knowledge out. A strong case to just ⌘+A ⌫.</p>\n<p>I eventually realised that what I actually wanted was to preserve my personal history. Even the most embarrassing notes felt too precious to delete. If nothing else, they are a record of where I've come from, and a reminder of how I've grown.</p>\n<p>It therefore felt apt to sort my files <em>by year</em>. I now have the same structure in all my apps:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token operator\">-</span> <span class=\"token maybe-class-name\">Archive</span>\n  <span class=\"token operator\">-</span> <span class=\"token number\">2024</span>\n  <span class=\"token operator\">-</span> <span class=\"token number\">2023</span>\n  <span class=\"token operator\">-</span> <span class=\"token spread operator\">...</span>\n<span class=\"token operator\">-</span> <span class=\"token maybe-class-name\">Personal</span>\n<span class=\"token operator\">-</span> <span class=\"token maybe-class-name\">Work</span>\n<span class=\"token operator\">-</span> <span class=\"token spread operator\">...</span>\n</code></pre>\n<p>Once a document becomes irrelevant, it can go into the archive and stay out of sight, leaving just a handful of active documents worth my attention.</p>\n<p>For the initial spring clean, I wrote a script to sort files by their creation date. In future years, I'll just copy and paste anything that hasn't already been archived into its annual folder, and, voila, that'll be it consigned to the past. My intention is to preserve whatever folder structure I have at the time, create a true snapshot of each year, and free myself from the psychological weight of perpetually keeping old data organised.</p>\n<p>After a few weeks using this system, I've found it to be effective. Cleaning up loose ends was cathartic too. And as a bonus I now have a chronological personal history, which has been fun to review.</p>"
}
