{
  "slug": "getting-hired-tight-labour-market",
  "title": "Getting Hired in a Tight Labour Market",
  "date": "2023-09-08",
  "status": "Published",
  "summary": "",
  "minutes": 4,
  "content": "<p>In the last few months I've noticed an uptick of coding graduates appearing at networking events, working the room in the hope they’ll make a connection that lands them a job.</p>\n<p>That's a marked difference from a couple of years ago: graduates of coding bootcamps seemingly had a direct route to partner businesses, while university graduates vanished inside big banks. The subsequent impact of tech layoffs, panicked sentiment about AI rendering our jobs obsolete, and the general economic downturn appears to have trickled down to the entry level. Perhaps the clearest sign of this here in Scotland is the recent collapse of CodeClan.</p>\n<p>I feel for developers in this position. I've trained and mentored dozens of coding students in the last few years and seen how landing their first job in tech was perhaps the hardest part of the whole process (although a life-changing event when they finally succeeded).</p>\n<p>I also relate. I started my coding career in 2008, a few months before the banking collapse triggered the biggest recession in living memory. For the next couple of years I turned over little more than £6k a year doing whatever freelance work I could pick up.</p>\n<p>This wasn’t a particularly easy way to start my career, but I learnt a lot, including many things I didn’t intend to learn. By the time I got my first tech job in 2012, I had become incredibly resourceful, understood multiple aspects of business (not least how to talk to clients), and had become a reasonably mature developer.</p>\n<p>To every budding graduate, I wish you a secure, well-paid and stable job. However, while the job market is tough, I encourage you to consider freelancing – at least just while you are job hunting. Landing your first full-time job is incredibly hard for the simple reason that, right now, you have little or no experience. When job candidates are in short supply, companies will foot the bill for you to acquire that experience. But when they are not, you may have to acquire the experience yourself.</p>\n<p>To get your first freelance job you need to present yourself as someone able to solve a problem that a company doesn’t have the skills to do themselves. For me, in 2008, this was building a website for a friend who was setting up a therapy business. In 2023, your services might also include setting up a no-code automation, scraping data from a website, or using GPT-4 in novel ways.</p>\n<p>There’s no formula for finding opportunities – it requires you to be resourceful and put yourself out there – but don’t pitch to big businesses or start cold calling companies. Talk to small businesses owners and charities that you already know. These are the organisations with zero technical resources, and for whom a little bit of technical know-how would be transformative.</p>\n<p>You might pitch yourself like this: “I’ve just graduated and am currently trying to land my first tech job. In the meantime, I’ve got a lot of time on my hands. Is there anything I could help you with?”. If you are already attending networking events, pose this question in conversation. See how many people reject your offer, but then start searching their mind for contacts they can put you in touch with.</p>\n<p>When it comes to navigating the money question, you can say something like, “I’m not looking for a big hourly wage – just enough to make ends meet. The most important thing is finding a project I can really throw myself into”. In a couple of sentences you reassure your listener that you’ll be good value for money, whilst also making it clear that you’re not making yourself available for exploitation.</p>\n<p>No doubt this will be a big learning curve. But life as a developer is continual learning on the job, so you might as well start now.</p>"
}
