{
  "slug": "gmi",
  "title": "You‘re Gonna Make It",
  "date": "2026-02-27",
  "status": "Published",
  "summary": "",
  "tags": [],
  "minutes": 3,
  "content": "<p>If you're a junior developer looking for a job and feeling scared, this post is for you.</p>\n<p>Take a step back from the internet.</p>\n<p>Take a deep breath.</p>\n<p>It's not all over.</p>\n<p>You are going to make it.</p>\n<hr>\n<p>It's true; you've spent the last three or four years learning how to code, and now most code is written by AI.</p>\n<p>It is also true that many startups will only hire senior developers because their bottleneck is code review, and that is inherently a more advanced skill.</p>\n<p>I suspect it's what comes next that keeps you awake at night though. Breathless warnings that AGI is imminent. Employment, as we know it, soon to be destroyed.</p>\n<p>It would be nice if the people creating this technology were less grandiose about its threats, and instead more compassionate toward the people they believe will have their livelihoods destroyed by it. But that's by the by. As <a href=\"https://substack.com/@oliverburkeman/note/c-215192080?r=2v0pkx&#x26;utm_medium=ios&#x26;utm_source=notes-share-action\">Oliver Burkeman</a> pointed out: <em>\"The predicted revolution must always be imminent; the reason to hand over money immediate\"</em>.</p>\n<p>Promoting a self-serving narrative doesn't automatically make these predictions wrong – humanity probably will see AGI one day – but the future is a big place; we should endeavour not to get lost in it.</p>\n<hr>\n<p>Let's return to <em>now</em>.</p>\n<p>Despite some <a href=\"https://www.cnbc.com/2026/02/26/block-laying-off-about-4000-employees-nearly-half-of-its-workforce.html\">newsworthy lay-offs</a>, there are indications that in early 2026 hiring of software engineers is on the rise – possibly in part due to the increased generation of code.</p>\n<p>That's a shift from when I wrote <a href=\"https://danielgrant.co/posts/getting-hired-tight-labour-market\">Getting Hired In A Tight Labour Market</a> a couple of years ago. Back then, I had a couple of suggestions: learn to use AI in novel ways, and freelance to gain experience.</p>\n<p>My advice today is similar, but with some small revisions: I am more optimistic about employment opportunities, and I would lean much harder into AI. (These two points are interrelated).</p>\n<p>In the next few months, companies will overhaul their software development lifecycle to account for AI-written code. They've never done this before. Many of the employees will be trying these tools out for the first time.</p>\n<p>You have an opportunity to be the most knowledgable and experienced person in the company on AI tooling. Experiment with Claude Code, OpenCode, Amp, Pi, Pi extensions, Code Rabbit. Run them with a human in the loop, run them without a human in a loop. See what weird things you can build.</p>\n<p>Above all, do not learn about this stuff second hand from social media. Learn by playing with the technology.</p>\n<p>Your tradcoding training remains relevant. Remember that reviewing code is the bottleneck? You must learn how to read code. In my early career, I used to read well-known codebases on the train home. I honestly think that was one of the best things I did to accelerate my understanding of how software works.</p>\n<p>If the job market proves inaccessible (or while you are navigating it), I still encourage all new developers to do some freelance work. I won't repeat the practical advice in my previous post on how to get started; just a few updates.</p>\n<p>Today, the barrier to building software is so much lower. But there is still a barrier – high enough that most business owners won't be able to (or want to) go over it, but low enough that you can drive the cost of custom software down to compete aggressively.</p>\n<p>There are countless small businesses and organisations out there who have software-shaped problems that two years ago would have been cost prohibitive for them to invest in, but today are feasibly affordable with AI-assisted coding. Go build something useful for them. They will be delighted.</p>\n<p>Chin up, and best of luck.</p>"
}
