{
  "slug": "more-than-one-way-to-work",
  "title": "More Than One Way to Work",
  "date": "2024-04-03",
  "status": "Published",
  "summary": "",
  "minutes": 11,
  "content": "<p>According to a recent startup <a href=\"https://sifted.eu/articles/founder-mental-health-2024\">survey</a>, 49% of founders are on the verge of quitting. One commented, “I cannot sustain this rhythm anymore. Solving problems seems the only purpose in my life and while doing it my mental and physical health is deteriorating.”</p>\n<p>I’m just starting out, but this already feels quite relatable. The workload is indeed relenting, which raises the question on how to effectively manage it. There are three common prescriptions:</p>\n<ul>\n<li><strong>Hustle culture</strong>: “14 hour days? Hell yeah! No-one won gold leaving the office at 5. Let's go!”</li>\n<li><strong>Slow productivity</strong>: “Seriously? Work smarter not harder, dumbass.”</li>\n<li><strong>Indie hacking</strong>: “Why spend your life grinding at the office when you could be making $40K a month, working 4 hours a week from a beach in Bali?”</li>\n</ul>\n<p>Each approach has its benefits, but as soon as one approach is perceived as <em>the right way</em> it takes on a certain toxic flavour. That’s not a broad swipe at the proponents of different working styles. It’s on me to see them as a range of options. But in the age of social media, it’s just too easy to read between the lines.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<table><thead><tr><th></th><th>What they're saying</th><th>What I hear</th><th>Reality</th></tr></thead><tbody><tr><td>Indie hacker</td><td>Do less for more by keeping it small and simple</td><td>You should find success more easily</td><td>Takes luck, prominence and/or outlier skills (likely forged with hard work)</td></tr><tr><td>Slow productivity</td><td>Focus on one thing at a time, and work within sensible boundaries</td><td>You should conform</td><td>Works best in stable, predictable contexts</td></tr><tr><td>Hustle culture</td><td>To make a big impact you need to work really really hard</td><td>You are not working hard enough</td><td>It’s only satisfying if you win; if you don’t, burnout is likely</td></tr></tbody></table>\n<p>Feeling judged is one thing, but what happens when a work culture actually turns toxic? One founder shared with me recently how he introduced a new employee to one of his investors. Unprompted and off-script, the investor took it upon themselves to brief the new employee on how startup life would mean working late and sacrificing their evenings.</p>\n<p>When sacrifices are made continually, without break or reward, we can expect burnout to follow. It’s not the long hours, per se, that cause burnout, it’s being subjected to unrelenting stressors. Whether that’s a firehose of deadlines, endless conflicts with a colleague, or a project that never ships, persist at anything for long enough, and eventually you will lose all motivation. (In the most severe cases, even the motivation to move your muscles).</p>\n<p>The power of hustle culture unfortunately cuts both ways. Hard work can compound into extraordinary success, but being overworked compounds into physical and mental demise.</p>\n<hr>\n<p>Unfortunately for me, I never had an intuition for compound interest. As a child, I was told it is <em>the most powerful force in the universe –</em> I realise now, by people who built up their savings through the 70s and 80s. In a low interest rate environment, however – such as the one I spent most of my adult life – the magic of compound interest does not kick in until after death.</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/153cdca7-b475-457b-8d77-1feb6f6ccfd5/compound-interest.png\" alt=\"Growth of a $100k investment over an adult lifespan at different interest rates\"><figcaption>Growth of a $100k investment over an adult lifespan at different interest rates</figcaption></figure>\n<p>It’s a useful metaphor perhaps for the widening generational wealth gap – or more poignantly, the gap between the <em>expectations</em> inherited by my generation and the current economic reality.</p>\n<p>Accordingly, a work culture rebellion is supposedly sweeping through social media. I say supposedly; I have little more insight on what happens inside TikTok than a boomer with a broadsheet, but if the reporting is to be believed, Gen Z has finally called BS. The social contract is broken, hustle culture leads only to cycles of burnout – bring on the soft life, quiet quitting and bare minimum Mondays.</p>\n<p>I broadly agree with the prognosis, and stand in solidarity with those who are demanding that labour gets an upgrade from the industrial revolution. But there’s a crinkle: <em>I</em> <em>really like work</em>. And as the cultural tide changes direction, I find myself swimming against the flow.</p>\n<hr>\n<p>This is an odd moment to make such a disclosure. Just yesterday, I met with a friend, and – in my own version of a bare minimum Monday – I explained how I could barely muster the motivation to get out of bed, let alone write a line of code. Ostensibly, I am burned out myself.</p>\n<p>If that’s true, then it is not my first rodeo. In 2021, I was forced to learn the practice of stopping. To stop and to stay stopped until all my energy and motivation had returned. After a short bout of covid, I realised that I had been left with chronic fatigue. Nothing and no-one can predict how long chronic fatigue will last. You hope it will pass quickly, but even this is a dangerous impulse – resisting fatigue only aggravates it.</p>\n<p>I learned to accept my fatigue, and after nine months, my energy levels returned to a normal level. My celebrations were short lived. On reflection, I may have booted back up too quickly, as a few weeks later I was in hospital getting an appendicectomy; and no sooner as I recovered from that I was floored again (quite literally) by a vertigo episode that took months to fully recover from.</p>\n<p>I don’t need to remind you of this, but I’ll say it anyway: good health is the most valuable thing you can possess. Without it, everything is so much harder. So when I think about how far I am willing to push myself to achieve my goals – even if I don’t always follow my own advice – I truly believe that good sleep, diet and exercise are non-negotiable.</p>\n<hr>\n<p>As we tuck into lunch, my friend is listening to my struggles intently, before turning to offer some advice. Sahir is only a few days from the start of her <a href=\"https://sasaonthemove.com/\">cycle trip to Pakistan</a>. I suspect this will be advice she will soon draw on herself.</p>\n<p>Long distance cycling was a good frame to place our discussion. A few years ago I cycled around New Zealand and had the best time of my life. The following year, I raised my game and cycled up the UK, averaging 170 miles a day. At the final pit stop, just 50 miles from John o’Groats, I collapsed on the heath in pain, and began sobbing next to a dead fox.</p>\n<p>The body, like the mind, has limits – and on that day I found mine. This was far from the best time of my life. For the following two weeks I was exhausted. On lunch breaks I would take naps on the meeting room sofa. I didn’t want to ride a bike again for months. I kept catching colds. Was all that pain really worth it? Just to be able to boast on my blog that I made it into the top ten of Strava's global leaderboard?</p>\n<p>Hell. Freakin’. Yeah.</p>\n<p>What can I say? Some people just enjoy the pain. Type one fun is delightful in the moment. Type two fun is utterly awful in the moment, but delightful afterwards. At level three, the fun never materialises, but some people like that too.</p>\n<hr>\n<p>If you’re feeling that I just trojan-horsed hustle porn into my wholesome blog, please don’t bolt just yet. I’d very much like to introduce you to the indie hacker community. According to its leaders, you can skip all that pain cosplaying <a href=\"https://www.youtube.com/watch?v=9XOj3Omc9GY&#x26;ab_channel=AlvinFoo\">Jensen Huang</a>, and fast-forward straight to revenue.</p>\n<p>Don’t take my word for it though. Watch for yourself as indie hacking legends #BuildInPublic, turning their weekend projects into recurring cash cows. This leaves just one question: how do you replicate their success? Let me tell you. By subscribing to their newsletter, or pre-ordering their book, or buying their coding boilerplate. See what happened there? Seductive tales of success just doubled up as a distribution channel. Clever.</p>\n<p>The reality is that <em>their</em> business model is not replicable. There are replicable indie hacker business models, but they’re probably not the ones you are being sold. It didn’t take long before <a href=\"https://www.indiehackers.com/post/after-losing-38676-as-an-indie-hacker-i-cant-do-it-anymore-i-quit-8673223598\">one</a> or <a href=\"https://news.ycombinator.com/item?id=34103896\">two</a> people realised that they're at the bottom of the pyramid scheme.</p>\n<p>Which brings us full circle, and back to slow productivity, the sensible middle ground. How many folks do you see writing posts complaining that work-life balance is damaging their mental health?</p>\n<p>Ahem. If I may say a few words…</p>\n<p>For most founders, work-life balance is an unreasonable expectation. Startups are bloody hard work, so let’s not make people feel worse by pretending that it should be easy.</p>\n<p>And, let’s also not reinforce the idea that people who work a lot have an unbalanced life. When we talk about work-life balance, I think what we are often striving to express is a stress-release balance. Stress is useful – it gets us moving - but it <em>must</em> be accompanied by some kind of release valve. For some people that is an evening spent cooking a casserole and drinking red wine, for others it’s watching Netflix or playing five-a-side. For me, I want the cycle to resolve within the context of work itself. Fortunately, I am in a position to make that possible.</p>\n<p>The truth is that I love elements of slow work – doing one thing at a time, and doing it well –  but I suck at traditional work-life balance. My brain is just not wired that way. I build up to a project, and then I dive in. Sometimes I overwork, and from time to time I crash. But that’s not the main threat to my mental health. Prolonged mundanity is what gets me. That’s perhaps more bummed out than it is burnt out, but either way it can be a tricky spot to get out of.</p>\n<p>The startup journey is long, and each founder has to forge their own path. It's a marathon, not a sprint. Unless, of course, you are a sprinter, in which case, it's probably going to be a series of sprints. You do you.</p>\n<hr>\n<p>“Do you believe you can achieve your goal?”, Sahir finally asks me. (At this point I am absolutely getting a free coaching session). I pause to reflect, but the answer is instinctively yes – and with that realisation comes a shift in my mood. As I project my mind forward, I realise there are in fact many possibilities, each interwoven with failure and success. The range of outcomes excites me. Hope is not lost.</p>\n<p>“Well then, if you believe that you will eventually succeed, the struggle you’re feeling today will only make success all the sweeter when it finally arrives”.</p>\n<p>Ah yes, that’s right… I actually like this process.</p>"
}
