{
  "slug": "nervous-system-tracking",
  "title": "Nervous System Tracking",
  "date": "2024-02-15",
  "status": "Published",
  "summary": "",
  "minutes": 3,
  "content": "<p>This is the first entry of a new section on my website: month notes!</p>\n<p>I was inspired by my GlasgowJS co-organiser, and all-round good chap, <a href=\"https://www.jamiemchale.com/\">Jamie McHale</a>, who last month completed five years’ of online journaling. Kudos for the consistent execution!</p>\n<p>Just to give you some idea of what to expect from these notes: I’ve noticed that each month of life ends up having a theme, so I will title the posts accordingly. Of course, one might ask: if I’m writing a thematic piece each month, isn’t that just, you know… blogging? Fair question. I don’t know. I think I just like the air cover of month notes – less pressure to be relevant or concise.</p>\n<hr>\n<p>I worked very hard through December in preparation for a YCombinator application. The process was incredible – I hadn’t been that productive in years – but I needed a recovery period over Christmas. And so, in January, I began the process of bringing my brain back online, and attempting to revive that elusive flow state.</p>\n<p>Being in flow is amazing, but forcing myself back into is probably not healthy. In moments of urgency, my default strategy is to generate stress to jolt myself into action. While that can be initially effective, it’s not a fun time, and it’s definitely not sustainable.</p>\n<p>The goals I had set for January were ambitious – redesign <a href=\"http://notation.dev/\">notation.dev</a>, build some new features, launch on HackerNews, and give two meetup talks. I needed to be on form. But by the time I gave my first meetup talk, I was too hyped to focus. I spent most of the night awake, subjected to a stream of loud internal chatter.</p>\n<p>I shared my restlessness with <a href=\"https://github.com/Happy0\">@happy0</a>, and he reflected back that I was seeming a bit manic.</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/42679d09-cc4d-420a-8c56-7a181749e692/happy0-chat.png\" alt=\"@happy0 checking in on me\"><figcaption>@happy0 checking in on me</figcaption></figure>\n<p>Around the same time, I was introduced to the concept of the window of tolerance. It describes the optimal zone of nervous system arousal where we're neither too activated (hyperaroused), nor too under-activated (hypoaroused).</p>\n<p>Realising that I was heading off the chart (figuratively), I did what any good engineer would do: I commandeered one of the whiteboard sheets covering my kitchen walls, moved it to my bedroom, and started a nervous system tracking chart (literally).</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/4f5e7987-08e0-4e1c-bd59-0dc08dbaff83/nervous-system-tracking.svg\" alt=\"A digital recreation of my nervous system tracking chat (17-31 January)\"><figcaption>A digital recreation of my nervous system tracking chat (17-31 January)</figcaption></figure>\n<p>Through tracking, I learned which interventions would send the chart up and down. The question became: given a starting state – whether that’s feeling high or low – what action is required to transition myself to the desired next state? Is it a coffee? Or is it a nap? Is it exercise? Or do I need to socialise less?</p>\n<p>That awareness has, in turn, helped me to better modulate. I also found that I could adjust my plans according to the trajectory I was on. I suspect this approach will prove essential for tapping into the power of flow.</p>\n<p>I hope this encourages you to explore your own window of tolerance and figure out what actions help you stay inside it, knowing when to pull back, and knowing when to push forward.</p>"
}
