{
  "slug": "opening-a-portal-to-silicon-valley",
  "title": "Opening a Portal to Silicon Valley",
  "date": "2024-03-04",
  "status": "Published",
  "summary": "",
  "minutes": 5,
  "content": "<p>I spent most of February in San Francisco. I was invited to join a pilot project, funded by the Scottish government, to establish a tech hub in Silicon Valley.</p>\n<p>It was a brilliant experience and a privilege to be included. But why exactly does the Scottish government want to send its entrepreneurs across the pond? Let’s explore!</p>\n<p>If you’re building a growing company in a small ecosystem, there comes a point when you need to step outside of your home base¹. Although significant investment has been committed to supporting the startup ecosystem in Scotland, publicly-funded interventions can only go so far – and, in some cases, may actually be decelerating startup growth².</p>\n<p>Reflecting on my experiences at the hub, there are a few things that San Francisco provides entrepreneurs that make this initiative a masterstroke of policy making:</p>\n<h3>1/ Confidence</h3>\n<p>The standout theme was the confidence boost founders experienced from interacting with people in Silicon Valley. It was moving to see founders realise their potential, and – within an environment where self-doubt gets little traction – transition seamlessly from realisation to self-actualisation.</p>\n<p>Scotland has, in my opinion, a particularly special culture. But it’s no secret that within our culture is a propensity to cut tall poppies down to size. It’s exciting to see a new generation of entrepreneurs challenge that mentality, asserting that it’s a good thing to dream big, and pushing back against negative realism. Failure is not only okay – failure fertilises the ground in which future success grows.</p>\n<h3>2/ Capital</h3>\n<p>Most of the founders at the hub were not raising investment. That’s representative of the wider business community – 99% of new businesses <a href=\"https://chrisneumann.com/archives/vc-probably-isnt-right-for-you\">do not need venture capital</a>, and most of those can bootstrap on revenue alone. But for the remaining 1% (who are overwhelming likely to fail), it’s important that they get their investment strategy right.</p>\n<p>Venture capital – the funding source for high-risk businesses – is predicated on the observation that 10% of VC investments produce 90% of the returns. That means that VC investors need to populate their portfolios with enough businesses to swing the odds in their favour – and those businesses must be targeting growth rates greater than what can be sustained by Scottish markets alone. For these reasons VC funds do not set up camp in Scotland.</p>\n<p>In theory, this is a non-issue. Scottish founders are not obligated to raise investment on their home turf, but, in practice, it is where most companies start their funding journey. Getting founders off territory helps them to understand how VC works in the real world, to build up the network required to kick off a fundraising round, and to avoid local investments that may be <a href=\"https://www.campfire.scot/i/139591887/show-me-the-eis\">clipping their wings</a>.</p>\n<h3>3/ Network</h3>\n<p>As a tech founder who is targeting the developer community, it was an absolute delight to have an almost daily schedule of tech and startup events in which to test ideas, and to make new connections.</p>\n<p>It never ceased to surprise me how often the first person I spoke to at an event would turn out to be a very important connection. San Francisco is crawling with the survivors of its success stories. That combined with its culture of lifting up and giving back makes it a uniquely valuable community.</p>\n<p>Other founders in the hub connected with customers and partners, set up conversations to learn from seasoned leaders, and held face-to-face meetings with investors.</p>\n<h3>4/ Insights</h3>\n<p>The final benefit I want to highlight is the unexpected exposure to new ideas.</p>\n<p>Silicon Valley is a super-charged network, and information moves around it at a remarkable velocity. Once I entered that network, I suddenly became aware that the number of words I was processing each day had skyrocketed (whether that was from presentations, conversations, or ideas being generated in my own mind).</p>\n<p>This accelerated me toward a couple of important realisations.</p>\n<p>The first was that my business was on course for failure. I wrote a <a href=\"https://docs.google.com/document/d/1H7Nnz2EarGCXvaMMDjNd-btM-DzbDszRk-sK_APprLA/edit#heading=h.7o4g5agnse04\">premortem document</a>, spent a day feeling depressed, then set my mind to figuring out how to correct course.</p>\n<p>The second realisation was appreciating the huge amount of value still on the table as a result of the recent breakthroughs in AI. Even if progress on AI were to halt today, we’d still have years of work ahead of us to fully integrate and innovate upon this technology.</p>\n<p>Insights like these are particularly valuable as they fast forward companies (particularly early-stage ones) towards both success and failure outcomes.</p>\n<hr>\n<p>Arriving back in Glasgow, I feel grateful to be home. I return with fresh insights, new connections, and, most importantly, an expanded growth mindset. I am also relieved to transition away from the intensity of the last month.</p>\n<p>Many founders have commented that Silicon Valley is a great place to pick up the pace, but not necessarily the best place to maintain that pace. It’s good be back in my quiet flat, reconnected with Scottish nature, hanging out with friends who don’t all work in tech, and ready to focus on the next stage of the journey.</p>\n<p>For that reason I don’t think Scotland should worry about emulating Silicon Valley. Our strengths are different. We just need to keep this portal open – so people, ideas and capital can move freely between the two ecosystems.</p>\n<hr>\n<p>[1] That point arrives at different stages depending on the type of business. For Notation, it was immediately. Building developer tools for cloud infrastructure is a long play (one which I’ve been repeatedly encouraged not to pursue), and <a href=\"https://a16z.com/open-source-from-community-to-commercialization/\">requires top-of-funnel growth</a> to achieve critical community mass – a prerequisite for enterprise adoption. To be in with a chance, I have to validate on day zero that what I am building has mass appeal. Needless to say, I was thrilled to have the opportunity to test my thesis at the epicentre of technology.</p>\n<p>[2] This is my personal opinion and – as far as I know – not the official position of the Scottish government.</p>"
}
