{
  "slug": "small-ecosystem-energy",
  "title": "Small Ecosystem Energy",
  "date": "2024-07-04",
  "status": "Published",
  "summary": "",
  "month": "June",
  "tags": [
    {
      "id": "f05f9618-efc6-45bb-be1d-5a47132f899e",
      "name": "Month Notes",
      "color": "red"
    }
  ],
  "minutes": 3,
  "content": "<p>After my life admin clean-up in April, I decided it was time to change environment and find some new energy. I visited a friend in Barcelona, where we spent a couple of weeks writing code and eating tapas.</p>\n<p>I kept the journey rolling into June and had a similarly great time meeting and staying with friends in Berlin, Istanbul, and, now, Bansko. Although I haven't gone out my way to tap into other country's startup ecosystems, it's still been interesting to observe and absorb the energy around them.</p>\n<p>Istanbul deserves it's own post. It is one of the most remarkable cities I've ever visited, steeped in a grand sense of history. If you can harness the ambient energy, you'll have an unlimited supply.</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/c74912c8-8363-4b79-a270-b2c6f768d2c0/istanbul-bosporus.jpg\" alt=\"Looking over the Bosporus, feeling as though I&#x27;m located at the crossroads of civilisation\"><figcaption>Looking over the Bosporus, feeling as though I'm located at the crossroads of civilisation</figcaption></figure>\n<p>Barcelona and Berlin have a similar vibe to the UK ecosystems I've worked in. They're now both fairly established economic centres. That brings greater economic opportunity, but also greater inertia.</p>\n<hr>\n<p>The word ecosystem is thrown around a lot, to an extent that we've perhaps become detached to its meaning. At a fundamental level, an ecosystem is system of interacting economic organisms – big companies supply contracts to new companies in return for innovation; wealthy investors supply capital to cash-strapped founders in return for potential future returns; governments provide grants and tax incentives in return for job creation and economic growth. And so on.</p>\n<p>So, it might appear that the more established ecosystems are better, because they have more of these economic organisms. But, there's more to it than that. A thriving ecosystem needs these organisms to interact with each other. This can be catalysed by a culture of openness and reciprocity. In theory, it can also be catalysed by ecosystem support organisations who organise events, provide co-working space, and offer matching services. But, probably the best catalyst of ecosystem interaction is density.</p>\n<p>Nothing propels progress quite like packing hustlers, hackers, designers, and investors into a small space. This is the weakness of the big established centres. They're too spread out, too dilute, too set in their ways. Without serendipity-level interactions, a localised ecosystem offers little over just doing it all online.</p>\n<p>At the early stage, I think founders – often frustrated by the inertia of their established environment – use the term \"ecosystem\" as a proxy for \"energy\". Taking a project from zero to one is like conjuring water out of the air – possible, but very energy intensive. You need to be surrounded by people who have a taste for the impossible, not just those whose experience is tapping into existing streams.</p>\n<hr>\n<p>Which brings me back to Bulgaria. You'd think that the country experiencing the worst demographic collapse anywhere in Europe wouldn't be contending to be its next tech hub, but I think this place has a lot going for it.</p>\n<p>Bansko is a small alpine town with probably the highest co-working space per capita of anywhere in the world. It has a high density of entrepreneurs and remote tech workers.</p>\n<p>On the other hand, it is not an established ecosystem, so there's also a low density of bureaucrats and corporate folk. Everything is being built from the ground up, free from \"adult supervision\".</p>\n<p>Combine those factors with Bulgaria's affordability, low tax rates and proximity to countries with abundant tech talent, and it feels possible that a cottage ecosystem could emerge.</p>\n<p>On top of that, I'm just generally charmed by this country. The food is great, the people are lovely, and the nature is stunning. I'm looking forward to returning.</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/054e79b2-9b6d-42ba-a841-ff0caa4ff468/F0F94864-DB54-412F-B0E3-C066ADF4FD7C_1_105_c.jpeg\" alt=\"Writing up my month notes in Bansko\"><figcaption>Writing up my month notes in Bansko</figcaption></figure>"
}
