{
  "slug": "tiny-launch-learnings",
  "title": "Learnings from a Tiny Launch",
  "date": "2023-07-13",
  "status": "Published",
  "summary": "A dissection of my tiny launch on social media, and the surprisingly valuable insights that can be extracted from a single tweet.",
  "tags": [],
  "minutes": 4,
  "content": "<p>Until last week, I hadn't thought much about the reach of my tweets. But, when I launched <a href=\"https://notation.dev/\">Notation</a>, I wanted to know exactly what the market thought of it.</p>\n<p>This post is a qualitative dissection of my tiny launch, and the surprisingly valuable insights that can be extracted from a social media post.</p>\n<h2>The Data</h2>\n<p>Let's dig into the first 12 hours of data. I'm not using any sophisticated tracking here – just page views from my (server-side) web analytics, and counting subscribers in SendGrid.</p>\n<h3>Twitter</h3>\n<p>On the surface, this was a <a href=\"https://twitter.com/djgrant_/status/1677231962811973632?s=20\">tweet</a>, which, at the time, had just 12 likes. But, looking deeper, we can uncover meaningful insights, and a framework for generating growth.</p>\n<p>For each like, there are nearly 10x the page views; and those views – as we'll see in a moment – translate to subscribers.</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/fd1b1629-7051-4cff-aee1-ddad4d329a9f/tiny-launch-conversion-rate-1.svg\" alt=\"A tweet with 4300 impressions generated 112 page views\"><figcaption>A tweet with 4300 impressions generated 112 page views</figcaption></figure>\n<p>This diagram illustrates just how powerful retweets are. A handful of users with large followings increased my tweet's reach by over 70x. That gave me data from outside my own network and a more significant sample to analyse.</p>\n<p>The key thing right now though is not the absolute numbers, but understanding how they can scale up. For this we need to calculate conversion rate:</p>\n<p><em>112 page views / 4300 impressions = 2.6% conversion rate</em></p>\n<h3>LinkedIn</h3>\n<p>My <a href=\"https://www.linkedin.com/posts/~djgrant_introducing-notation-activity-7082991667540054016-FKqW/?utm_source=share&#x26;utm_medium=member_desktop\">LinkedIn post</a> didn't reach as far beyond my own network (this is where Twitter really excels – content somehow finds its way to exactly the right audience). LinkedIn did, however, get my post in front of a much high proportion of eyeballs than Twitter (38% vs 12%). This may be partly explained by the release of Threads on the same day.</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/6d8b23d9-eb0d-4bd8-ac70-57089433c341/tiny-launch-conversion-rate-2.svg\" alt=\"A LinkedIn post with 1300 impressions generated 35 page views\"><figcaption>A LinkedIn post with 1300 impressions generated 35 page views</figcaption></figure>\n<p>The near identical conversion rate of impressions to visitors (2.7% vs Twitter's 2.6%) is likely to be coincidental as I have very different audiences on these platforms.</p>\n<p>Nonetheless, LinkedIn looks like a promising platform for getting niche content to the right audience, and I'll be making more of an effort to optimise how I use it to engage with other developers.</p>\n<h3>Converting visitors to subscribers</h3>\n<p>Comments, likes, bookmarks and retweets can all be interpreted as positive signals, but the key metric I am focussed on is subscribers to Notation's <a href=\"https://notation.dev/#sign-up\">early access list</a>. In the absence of a product to \"sell\", an email sign up is the closest thing to expressing purchasing intent.</p>\n<p>To get a more realistic sense of conversion, I excluded personal contacts from the subscriber count.</p>\n<figure class=\"\"><img src=\"/images/412ff53b-7059-4aa2-b979-ec845303689f/4ceb5753-6c31-4e8c-b2c5-a7f938f1bfb0/tiny-launch-conversion-rate-3.svg\" alt=\"About 3% of all visitors eventually subscribed to Notation\"><figcaption>About 3% of all visitors eventually subscribed to Notation</figcaption></figure>\n<h2>Reflections</h2>\n<p>It's tempting, especially when launching something that you've put a lot of work into, to hope it immediately finds a large audience. A launch, however, is not a single event. It is an announcement that evolves and unfolds over time. The most important thing for me right now is to uncover learnings that steer the direction of the product and its ongoing launch.</p>\n<h3>Conversion rates</h3>\n<p>This was a low-key launch of a very early-stage product, but the conversion rates already look like numbers I can work with:</p>\n<ul>\n<li>With some effort 10x as many eyeballs feels achievable</li>\n<li>A 10x increase in subscribers would be a good early-adopter base</li>\n<li>All conversion rates can be improved with optimisation</li>\n<li>More posts will help maximise sign-ups among existing audience</li>\n</ul>\n<h3>Future experiments</h3>\n<p>After sharing Notation publicly, I now have better answers to these questions:</p>\n<ul>\n<li>What do I need to do to onboard X number of subscribers?</li>\n<li>What types of people are interested in Notation?</li>\n</ul>\n<p>But, I still need to conduct experiments to help me answer these questions:</p>\n<ul>\n<li>How can the product become more appealing?</li>\n<li>How can the messaging resonate better?</li>\n</ul>\n<p>Those answers will come partly from testing new online content. But, at this stage, the best insights still come from talking to users directly.</p>\n<p>If you have any comments or suggestions, drop me a message – I'd love to hear your thoughts. And, if you liked this post and want to see more updates like this, follow me on social media.</p>"
}
